IDENTIFICATION DIVISION.
PROGRAM-ID. ARITHDEMO.
PROCEDURE DIVISION.
    ADD WS-A WS-B TO WS-C.
    ADD WS-A WS-B GIVING WS-C ROUNDED.
    SUBTRACT WS-A FROM WS-B GIVING WS-C.
    MULTIPLY WS-A BY WS-B.
    DIVIDE WS-A INTO WS-B GIVING WS-C ROUNDED.
    COMPUTE WS-X ROUNDED = (WS-A + WS-B) * WS-C - 2 ** 3.
    COMPUTE WS-X WS-Y = WS-A / WS-B END-COMPUTE.
    ADD 1 TO WS-COUNTER END-ADD.
    STOP RUN.
