IDENTIFICATION DIVISION.
PROGRAM-ID. SECTDEMO.
PROCEDURE DIVISION.
MAIN-SECTION SECTION.
    DISPLAY "main".
INIT-PARA.
    MOVE 0 TO WS-A.
    DISPLAY WS-A.
WORK-SECTION SECTION 50.
COMPUTE-PARA.
    ADD 1 TO WS-A.
    STOP RUN.
