IDENTIFICATION DIVISION.
PROGRAM-ID. OUTER.
DATA DIVISION.
LINKAGE SECTION.
01 LK-INPUT PIC X(10).
01 LK-OUTPUT PIC 9(4).
01 LK-CODE PIC 9.
PROCEDURE DIVISION USING BY REFERENCE LK-INPUT BY VALUE LK-OUTPUT RETURNING LK-CODE.
DECLARATIVES.
ERR-SECTION SECTION.
    USE AFTER STANDARD ERROR PROCEDURE ON INPUT.
HANDLE-ERR.
    DISPLAY "io error".
END DECLARATIVES.
MAIN-SECTION SECTION.
MAIN-PARA.
    MOVE LK-INPUT TO LK-OUTPUT.
    DISPLAY LK-OUTPUT.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. INNER.
PROCEDURE DIVISION.
    DISPLAY "inner".
    STOP RUN.
END PROGRAM INNER.
END PROGRAM OUTER.
